aijunlin/stm32_freertos_newest_hardware2.0/SYSTEM/uart/uart.h
/**
  ******************************************************************************
  * @file    uart.h
  * @author  FZetc飞贼
  * @version V0.0.1
  * @date    2025.10.25
  * @brief   1、uart初始化
  *          2、uart中断接收通信
  *          3、uart发送数据
  *
  ******************************************************************************
  * @attention
  *	
  *	本文档只供学习使用，不得商用，违者必究
  *
  * 微信公众号：    FZetc飞贼
  * CSDN博客：      https://blog.csdn.net/qq_58629108?type=blog
  * 有疑问或者建议： FZetcSnitch@163.com
  *
  ******************************************************************************
  */

#ifndef __UART_H		// 定义以防止递归包含
#define __UART_H


// 一、其它头文件
#include <stdio.h>
#include "stm32f4xx.h"
#include "my_config.h"
#include "my_reg.h"
#include "my_lib.h"

// 二、宏定义(函数、变量、常量)

// 三、自定义的数据类型(结构体、联合体、枚举等)
#define ESP8266_DEBUG 1
#define UART2_RUN     0
#define UART2_DEBUG   1

#define RX1_BUF_SIZE 256
#define RX2_BUF_SIZE 256
#define RX3_BUF_SIZE 256

#define TX1_BUF_SIZE 256
#define TX2_BUF_SIZE 256
#define TX3_BUF_SIZE 256


// 四、全局变量声明
// 声明全局变量
extern volatile uint8_t  u1_recvbuf[RX1_BUF_SIZE];
extern volatile uint8_t  u1_count;
extern volatile int8_t   u1_flag;

extern volatile uint8_t  u2_recvbuf[RX2_BUF_SIZE];
extern volatile uint8_t  u2_count;
extern volatile int8_t   u2_flag;


extern volatile uint8_t  u3_recvbuf[RX3_BUF_SIZE];
extern volatile uint16_t u3_count;
extern volatile uint16_t u3_len;
extern volatile int8_t   u3_flag;



// 五、函数声明
extern void UART1_Init( uint32_t baud_rate);
extern void USART1_SendStr(const char *str);
extern void USART1_IRQHandler(void);

extern void UART2_Init( uint32_t baud_rate);
extern void USART2_SendStr(const char *str);
extern void USART2_IRQHandler(void);

extern void UART3_Init( uint32_t baud_rate);
extern void USART3_SendStr(const char *str);
extern void USART3_IRQHandler(void);

extern void USART_BlueTooth_GetMsg(void);	
extern void USART_BlueTooth_SetMsg(const char* name, const char* pswd, const char* uart);


// 六、静态变量、函数定义

#endif /* __UART_H */

